{
  "backend/main.mo": "Minimal Motoko actor with no methods defined.",
  "feature_evidence.json": "Feature evidence report linking content updates to the CollectionsSection component with metadata and related components.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files describing styling, layout, sections, and configuration behavior.",
  "frontend/DEPLOYMENT.md": "Guide outlining prerequisites and steps for deploying the frontend to IC mainnet, including required assets and filename considerations.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables for light and dark themes and applying global background and text settings.",
  "frontend/index.html": "HTML entry point with SEO metadata, favicon, Open Graph tags, fonts, and script bootstrapping the React app.",
  "frontend/src/App.tsx": "Root app component composing the site’s header and all sections in order within the main layout.",
  "frontend/src/components/layout/SiteFooter.tsx": "Empty footer component placeholder with no implementation.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive fixed header with logo, smooth-scroll navigation, mobile menu toggle, and scroll-based styling changes.",
  "frontend/src/components/sections/AboutCapabilitiesSection.tsx": "Section displaying four manufacturing capability cards with icons, titles, and descriptions.",
  "frontend/src/components/sections/BenefitsSection.tsx": "Section listing four benefits with icons and descriptions laid out in a responsive grid.",
  "frontend/src/components/sections/CollectionsSection.tsx": "Collections section defining four carpet categories, selecting random thumbnails, and rendering collection cards with tags and imagery.",
  "frontend/src/components/sections/ContactCtaSection.tsx": "Renders a contact call-to-action section with phone, email, and location cards plus buttons linking to contact actions.",
  "frontend/src/components/sections/GallerySection.tsx": "Displays a filterable image gallery with modal preview, handling categories, image loading, and asset URL encoding.",
  "frontend/src/components/sections/HeroSection.tsx": "Defines the hero banner with background image, headline, and buttons that scroll to gallery or contact sections.",
  "frontend/src/config/contact.ts": "Exports centralized contact information including phone, email, and location with map URLs.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the current identity, invalidating related queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, managing login, logout, stored identity, and AuthClient setup.",
  "frontend/src/index.css": "Tailwind base styles plus custom CSS variables for theme colors and typography, including dark mode support.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClient and InternetIdentity providers and renders the root component.",
  "frontend/src/utils/publicAssetUrl.ts": "Builds properly encoded asset URLs using the base path and encoding each path segment.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, custom theme extensions (colors, fonts, animations), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing a website content update, including a new collections section and a 'Request Samples' email CTA."
}