{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report listing two Contact CTA text and test‑hook update requirements with associated files and metadata.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of multiple frontend files for build reference.",
  "frontend/DEPLOYMENT.md": "Deployment guide outlining prerequisites and required asset verification before publishing to IC mainnet.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color tokens, dark mode variables, and global element styles.",
  "frontend/index.html": "Main HTML entry with metadata, favicon, OG tags, and Google Fonts plus script root mount.",
  "frontend/src/App.tsx": "Composes site sections with a disabled Collections section via feature flag.",
  "frontend/src/components/layout/SiteFooter.tsx": "Empty file placeholder for footer component.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive fixed header with logo, smooth-scroll navigation, and mobile menu toggle.",
  "frontend/src/components/sections/AboutCapabilitiesSection.tsx": "About section listing four capabilities with icons in a card grid.",
  "frontend/src/components/sections/BenefitsSection.tsx": "Benefits section showing four icon-only advantages with centered layout.",
  "frontend/src/components/sections/CollectionsSection.tsx": "Collections grid showing carpet categories with randomized or fixed thumbnails and tag lists.",
  "frontend/src/components/sections/ContactCtaSection.tsx": "Renders a contact CTA section with phone, location, WhatsApp, and directions links plus footer attribution.",
  "frontend/src/components/sections/CustomCarpetsCtaSection.tsx": "Displays a custom carpets CTA with a hero image, capabilities list, supporting text, and WhatsApp project-start button.",
  "frontend/src/components/sections/GallerySection.tsx": "Implements an image gallery with category metadata, error tracking, and a modal for viewing selected images.",
  "frontend/src/components/sections/HeroSection.tsx": "Shows the hero banner with background image, headline, and buttons to view the gallery or start a WhatsApp project.",
  "frontend/src/config/contact.ts": "Defines contact details and exports a helper to build encoded WhatsApp message URLs.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, managing login, stored identities, and exposing identity status flags.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, dark mode overrides, and utility classes for layout and typography.",
  "frontend/src/main.tsx": "Bootstraps the app by mounting React, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/utils/publicAssetUrl.ts": "Builds an encoded URL for static assets by encoding path segments and prepending the environment base URL.",
  "frontend/tailwind.config.js": "Configures Tailwind content paths, theming extensions, colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines project metadata, known issues, and feature requirements for updating and verifying the Contact CTA tagline."
}