{
  "backend/main.mo": "Minimal Motoko actor with no functions or state.",
  "feature_evidence.json": "Feature evidence listing four UI modification requirements for CustomCarpetsCtaSection, each tied to specific files and components.",
  "frontend-file-summaries.txt": "Text file containing summarized descriptions of multiple frontend files for reference.",
  "frontend/DEPLOYMENT.md": "Deployment guide outlining prerequisites and required static assets for publishing the site to IC mainnet.",
  "frontend/index.css": "Tailwind base and utility layers defining OKLCH color variables, dark mode tokens, and global styles.",
  "frontend/index.html": "Main HTML entry with metadata, favicons, Open Graph tags, and font preloading for Arapey and Jost.",
  "frontend/src/App.tsx": "Root React component assembling page sections with a feature flag disabling the Collections section.",
  "frontend/src/components/layout/SiteFooter.tsx": "Empty file containing no footer implementation.",
  "frontend/src/components/layout/SiteHeader.tsx": "Sticky header with smooth-scroll navigation, mobile menu, and logo using getPublicAssetUrl.",
  "frontend/src/components/sections/AboutCapabilitiesSection.tsx": "Section displaying four capabilities using icon cards with a centered heading and description.",
  "frontend/src/components/sections/BenefitsSection.tsx": "Benefits grid showing four icon-only cards with a heading and subheading for designer advantages.",
  "frontend/src/components/sections/CollectionsSection.tsx": "Renders a collections grid with randomized or fixed thumbnails and descriptive tags for each carpet type.",
  "frontend/src/components/sections/ContactCtaSection.tsx": "Displays contact details, CTA buttons for WhatsApp and directions, and footer attribution.",
  "frontend/src/components/sections/CustomCarpetsCtaSection.tsx": "Shows a custom carpets pitch with capabilities list, hero image, and a WhatsApp project-start CTA.",
  "frontend/src/components/sections/GallerySection.tsx": "Implements an image gallery with categories, modal viewer, and error handling for missing images.",
  "frontend/src/components/sections/HeroSection.tsx": "Provides the homepage hero section with background image, headline, and CTAs for viewing work or starting a project.",
  "frontend/src/components/sections/UsefulLinksSection.tsx": "Renders a grid of external platform links with auto-selected icons and responsive layout.",
  "frontend/src/config/contact.ts": "Exports contact details and a helper to generate WhatsApp URLs with prefilled messages.",
  "frontend/src/config/usefulLinks.ts": "Defines a list of external useful links including labels, URLs, and optional icons.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor using react-query and refreshes dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, including loading, login, logout, and identity persistence.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for a warm neutral theme with light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider, then renders App.",
  "frontend/src/utils/publicAssetUrl.ts": "Builds a correctly encoded URL for static assets based on the Vite base path.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, fonts, animations, and includes typography, container queries, and animation plugins.",
  "project_state.json": "Stores the project's metadata, requirements, existing features, and pending feature requests for Section 3 updates."
}