{
  "backend/main.mo": "Empty Motoko actor with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report describing required mobile layout updates for BenefitsSection.tsx.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for all frontend source files.",
  "frontend/DEPLOYMENT.md": "Deployment guide outlining prerequisites and steps for publishing the site to IC mainnet, including required gallery assets.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables, dark mode overrides, and global background/text styles.",
  "frontend/index.html": "HTML entry point setting up metadata, fonts, favicon, and loading the React application root.",
  "frontend/src/App.tsx": "Main app component composing header and all content sections in order.",
  "frontend/src/components/layout/SiteFooter.tsx": "Empty footer component file with no implementation.",
  "frontend/src/components/layout/SiteHeader.tsx": "Fixed header with smooth-scroll navigation, mobile menu, and asset-safe logo loading.",
  "frontend/src/components/sections/AboutCapabilitiesSection.tsx": "About section showing four capability cards with icons and descriptive text.",
  "frontend/src/components/sections/BenefitsSection.tsx": "Benefits section rendering four advantage cards with mobile-first typography and grid layout.",
  "frontend/src/components/sections/CollectionsSection.tsx": "Collections section displaying four carpet categories with randomly selected thumbnails and feature tags.",
  "frontend/src/components/sections/ContactCtaSection.tsx": "Renders a contact section with cards for phone, email, and location plus CTA buttons using CONTACT config.",
  "frontend/src/components/sections/GallerySection.tsx": "Displays a filterable gallery of categorized images with modal preview and error handling.",
  "frontend/src/components/sections/HeroSection.tsx": "Shows a hero banner with background image and buttons that scroll to gallery or contact sections.",
  "frontend/src/config/contact.ts": "Exports contact details including phone, email, and location links used across the site.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refetching queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading, login, logout, and identity management.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/utils/publicAssetUrl.ts": "Builds encoded public asset URLs respecting base path and handling special characters.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom theme extensions (colors, fonts, animations), and plugins for typography, container queries, and animations.",
  "project_state.json": "JSON describing project state, including schema version, project summary, existing features, and a pending mobile layout adjustment request."
}