{
  "backend/main.mo": "Defines an empty Motoko actor with no methods or logic.",
  "feature_evidence.json": "Contains feature evidence entries mapping frontend files to implemented branding and favicon updates.",
  "frontend-file-summaries.txt": "Text file providing high-level summaries of major frontend components, styles, configuration, and sections.",
  "frontend/DEPLOYMENT.md": "Deployment guide outlining prerequisites and required asset checks for publishing the site to IC mainnet.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color variables, dark mode tokens, and global background/foreground styling.",
  "frontend/index.html": "Main HTML entry including metadata, OG tags, encoded favicon references, and font preconnects.",
  "frontend/src/App.tsx": "Composes the site layout by rendering header, footer, and all main content sections in order.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer component displaying branding, quick links, and contact details with URLs from shared config.",
  "frontend/src/components/layout/SiteHeader.tsx": "Fixed header with scroll-aware styling, logo, smooth-scroll navigation, and mobile menu handling.",
  "frontend/src/components/sections/AboutCapabilitiesSection.tsx": "Section showing four capabilities using icon cards with brief descriptions.",
  "frontend/src/components/sections/BenefitsSection.tsx": "Section displaying four benefit items in a responsive grid with simple icon-based cards.",
  "frontend/src/components/sections/CollectionsSection.tsx": "Displays carpet collections with random thumbnails selected on mount and renders feature tags for each.",
  "frontend/src/components/sections/ContactCtaSection.tsx": "Renders contact cards and call-to-action buttons using shared CONTACT config values.",
  "frontend/src/components/sections/GallerySection.tsx": "Provides a filterable image gallery with modal viewing and error handling for failed image loads.",
  "frontend/src/components/sections/HeroSection.tsx": "Shows a hero banner with background image and buttons that scroll to gallery or contact sections.",
  "frontend/src/config/contact.ts": "Exports centralized phone, email, and location details for site-wide contact usage.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context with login, logout, identity persistence, and status tracking.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom color variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/utils/publicAssetUrl.ts": "Builds a fully encoded asset URL using the base path and encoded path segments.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme settings, colors, animations, and enabling plugins for typography, queries, and animations.",
  "project_state.json": "JSON file defining project metadata, existing features, and a pending feature request related to using an uploaded asset as the site logo."
}