{
  "backend/main.mo": "Empty Motoko actor definition with no functions or logic.",
  "feature_evidence.json": "Feature evidence report describing deployment of the marketing site to IC mainnet and linking related components and tests.",
  "frontend-file-summaries.txt": "Text file containing pre-generated summaries of various frontend files and their roles in the site.",
  "frontend/DEPLOYMENT.md": "Deployment guide detailing prerequisites and steps to build and deploy the marketing site to IC mainnet.",
  "frontend/index.css": "Tailwind base stylesheet defining color tokens, theme variables, and global styles for light and dark modes.",
  "frontend/index.html": "Main HTML entry with SEO metadata, favicons, font loading, and root mount point for the React app.",
  "frontend/src/App.tsx": "Top-level React component assembling the site layout with header, footer, and all main sections.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer component displaying branding, quick links, contact info, and attribution.",
  "frontend/src/components/layout/SiteHeader.tsx": "Fixed header with smooth-scroll navigation, responsive menu, and a CTA button.",
  "frontend/src/components/sections/AboutCapabilitiesSection.tsx": "Section highlighting four company capabilities using icons and brief descriptions.",
  "frontend/src/components/sections/BenefitsSection.tsx": "Section showcasing four key carpet benefits with icons and short text.",
  "frontend/src/components/sections/CollectionsSection.tsx": "Renders a grid of carpet collection cards with images, descriptions, and features.",
  "frontend/src/components/sections/ContactCtaSection.tsx": "Displays contact options and call‑to‑action buttons using phone and email details from config.",
  "frontend/src/components/sections/GallerySection.tsx": "Provides a filterable image gallery with category selection and modal image viewing.",
  "frontend/src/components/sections/HeroSection.tsx": "Shows a hero banner with background image and buttons that scroll to gallery or contact sections.",
  "frontend/src/config/contact.ts": "Exports centralized phone and email contact information.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook handling login, stored identity loading, and authentication state.",
  "frontend/src/index.css": "Sets up Tailwind and defines custom CSS variables, themes, and base styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom colors, typography, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project's state, versioning, and a list of features describing requirements for a simplified single-page marketing and gallery-focused website."
}