{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report listing two UI text and alignment changes tied to BenefitsSection.tsx.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files for build/reference purposes.",
  "frontend/DEPLOYMENT.md": "Guide for deploying the site to IC mainnet and verifying required gallery assets.",
  "frontend/index.css": "Tailwind base setup defining OKLCH design tokens, dark mode variables, and global styling.",
  "frontend/index.html": "HTML entry point with SEO metadata, favicon, fonts, and root mount for the React app.",
  "frontend/src/App.tsx": "Main React app composing header and all site sections in order.",
  "frontend/src/components/layout/SiteFooter.tsx": "Empty footer file with no implementation.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive fixed header with smooth-scroll navigation, logo, and mobile menu.",
  "frontend/src/components/sections/AboutCapabilitiesSection.tsx": "Section displaying four capability cards with icons and descriptions.",
  "frontend/src/components/sections/BenefitsSection.tsx": "Benefits grid showing four advantages with icons, centered titles, and justified descriptions.",
  "frontend/src/components/sections/CollectionsSection.tsx": "Renders a collections grid with randomized thumbnails and static data for carpet categories. Uses useMemo to choose a stable random image per collection.",
  "frontend/src/components/sections/ContactCtaSection.tsx": "Displays contact cards (phone, email, location) and CTA buttons using shared CONTACT config. Provides call, email, and visit actions with styled UI components.",
  "frontend/src/components/sections/GallerySection.tsx": "Implements a gallery with category filtering, modal previews, and error handling for images. Precomputes asset URLs and manages selected image state.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero section with a background image, headline, and buttons that smooth-scroll to gallery and contact sections. Uses Tailwind for layout and styling.",
  "frontend/src/config/contact.ts": "Exports constant CONTACT object containing phone, email, and location details including map URLs. Serves as the single source of truth for site contact info.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity authentication using React Query. Recreates and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context for Internet Identity authentication, handling login, identity persistence, and state management. Wraps AuthClient with custom initialization and error handling.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for a warm color palette with light and dark mode variants. Adds global font, spacing, and utility adjustments.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrapped around App. Imports global styles and mounts the root component.",
  "frontend/src/utils/publicAssetUrl.ts": "Utility to build encoded asset URLs by cleaning and encoding path segments and applying the Vite base URL.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugins such as typography, container queries, and animate.",
  "project_state.json": "Project state file tracking feature changes, requests, metadata, and current update tasks for benefits card text and alignment."
}