{
  "backend/main.mo": "Minimal Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report describing two gallery UI adjustments and their related files and metadata.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for various frontend files and components.",
  "frontend/DEPLOYMENT.md": "Deployment guide detailing prerequisites and steps for publishing the site to IC mainnet, including required gallery assets.",
  "frontend/index.css": "Tailwind base file defining OKLCH color variables, dark mode tokens, and global styling utilities.",
  "frontend/index.html": "Main HTML entry with metadata, fonts, favicon, and script mounting the React app.",
  "frontend/src/App.tsx": "Top-level React app composing all site sections and conditionally rendering the Collections section.",
  "frontend/src/components/layout/SiteFooter.tsx": "Empty file with no content.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive header with scroll behavior, smooth navigation links, logo, mobile menu, and contact CTA.",
  "frontend/src/components/sections/AboutCapabilitiesSection.tsx": "Section displaying four capability cards with icons, headings, and descriptions.",
  "frontend/src/components/sections/BenefitsSection.tsx": "Benefits section showing four icon-based cards and a heading/subheading describing designer advantages.",
  "frontend/src/components/sections/CollectionsSection.tsx": "Renders a collections grid with random or fixed thumbnails and metadata for each carpet category.",
  "frontend/src/components/sections/ContactCtaSection.tsx": "Displays contact cards, WhatsApp and directions buttons, and footer attribution for reaching the business.",
  "frontend/src/components/sections/CustomCarpetsCtaSection.tsx": "Provides a custom carpets CTA with capability list, full-width hero image, and WhatsApp project link.",
  "frontend/src/components/sections/GallerySection.tsx": "Shows a filterable image gallery with modal view, error handling, and precomputed asset URLs.",
  "frontend/src/components/sections/HeroSection.tsx": "Landing hero with background image, headline, gallery scroll button, and WhatsApp project CTA.",
  "frontend/src/components/sections/UsefulLinksSection.tsx": "Displays external platform links with dynamic icons and responsive grid layout.",
  "frontend/src/config/contact.ts": "Defines global contact details and helper for generating prefilled WhatsApp URLs.",
  "frontend/src/config/usefulLinks.ts": "Exports a list of external links used in the Useful Links section.",
  "frontend/src/hooks/useActor.ts": "Provides a React hook that creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Defines a React context and provider for managing Internet Identity login, stored identities, and auth state using AuthClient.",
  "frontend/src/index.css": "Configures Tailwind base styles and CSS variables for light/dark themes with custom typography and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/utils/publicAssetUrl.ts": "Generates a safe, encoded URL for assets based on the project's base path.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, container settings, animations, and enabling plugins.",
  "project_state.json": "Metadata describing project state, feature requests, and layout adjustments for spacing and section dividers."
}