{
  "backend/main.mo": "Minimal Motoko canister with an empty actor.",
  "feature_evidence.json": "Feature evidence report detailing three gallery‑related features, affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files including layout, sections, config, and deployment docs.",
  "frontend/DEPLOYMENT.md": "Deployment guide outlining prerequisites and steps for verifying static assets and deploying to IC mainnet.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color tokens, dark mode values, and global element styling.",
  "frontend/index.html": "Main HTML entry with metadata, OG tags, favicon links, and Google Fonts setup.",
  "frontend/src/App.tsx": "Root React component composing the site layout and all major sections in order.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer with logo, quick links, and contact info including maps and directions links.",
  "frontend/src/components/layout/SiteHeader.tsx": "Fixed header with scroll‑aware styling, smooth‑scroll navigation, and mobile menu.",
  "frontend/src/components/sections/AboutCapabilitiesSection.tsx": "Compact capabilities section showing four manufacturing strengths using cards and icons.",
  "frontend/src/components/sections/BenefitsSection.tsx": "Benefits grid highlighting four product advantages with icons and brief descriptions.",
  "frontend/src/components/sections/CollectionsSection.tsx": "Renders a collections grid with images, descriptions, and feature tags for various carpet types.",
  "frontend/src/components/sections/ContactCtaSection.tsx": "Displays a contact section with phone, email, location cards, and call‑to‑action buttons.",
  "frontend/src/components/sections/GallerySection.tsx": "Implements an image gallery with category filtering, error handling, and modal image viewing.",
  "frontend/src/components/sections/HeroSection.tsx": "Provides a hero banner with background image and buttons that scroll to gallery or contact sections.",
  "frontend/src/config/contact.ts": "Exports centralized contact details including phone, email, and location with map URLs.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Defines a provider and hook for managing Internet Identity login, storage, and authentication state.",
  "frontend/src/index.css": "Configures Tailwind layers and custom CSS variables for color themes, typography, and global styles.",
  "frontend/src/main.tsx": "App entry point initializing React, query client, Internet Identity provider, and global styles.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom theme extensions, colors based on CSS variables, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s current state, features, issues, and requirements for a simplified single‑page marketing site focused on a gallery-first layout."
}