{
  "backend/main.mo": "Empty actor definition placeholder for backend canister.",
  "feature_evidence.json": "Metadata describing a feature request to update a specific image in CustomCarpetsCtaSection for full-width cover behavior.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files including styles, config, sections, and layout components.",
  "frontend/DEPLOYMENT.md": "Guide outlining prerequisites and steps for deploying the site to IC mainnet, including required static assets.",
  "frontend/index.css": "Tailwind base layer with extensive OKLCH color variables and dark mode definitions for global styling.",
  "frontend/index.html": "Main HTML entry with SEO metadata, favicon, font preconnects, and root mount point.",
  "frontend/src/App.tsx": "Top-level React component assembling the site sections with a disabled Collections feature flag.",
  "frontend/src/components/layout/SiteFooter.tsx": "Empty placeholder file for the site footer component.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive header with scroll detection, smooth-scroll navigation, mobile menu, and branded logo.",
  "frontend/src/components/sections/AboutCapabilitiesSection.tsx": "Section listing four capabilities using icon cards with centered layout and descriptive text.",
  "frontend/src/components/sections/BenefitsSection.tsx": "Section displaying four benefit cards with icons and responsive grid layout.",
  "frontend/src/components/sections/CollectionsSection.tsx": "Collections display component selecting thumbnails via useMemo and rendering collection cards with images and tags.",
  "frontend/src/components/sections/ContactCtaSection.tsx": "Renders a contact section with phone, email, location links, WhatsApp CTA, and footer attribution.",
  "frontend/src/components/sections/CustomCarpetsCtaSection.tsx": "Displays a custom carpets CTA with an image, capabilities list, and WhatsApp project-start button.",
  "frontend/src/components/sections/GallerySection.tsx": "Shows a filterable gallery with modal viewer, error handling, and precomputed asset URLs.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero banner with background image, intro text, scroll-to-gallery button, and WhatsApp CTA.",
  "frontend/src/config/contact.ts": "Defines contact details and provides a helper to build encoded WhatsApp URLs.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context with login, logout, and identity loading logic.",
  "frontend/src/index.css": "Tailwind CSS setup with custom color variables, theming, typography, and utility classes.",
  "frontend/src/main.tsx": "Application entry point initializing React, query client, and Internet Identity provider.",
  "frontend/src/utils/publicAssetUrl.ts": "Builds a base-aware, encoded URL for assets by cleaning and encoding path segments.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, plugins, and container settings.",
  "project_state.json": "Stores project metadata, feature records, and a pending request for full-bleed CTA image behavior."
}