{
  "backend/main.mo": "Minimal Motoko actor with no methods or logic.",
  "feature_evidence.json": "Report describing a feature that removes six specific gallery images by deleting their entries from galleryImages.ts.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files including styles, config, HTML, layout, and sections.",
  "frontend/DEPLOYMENT.md": "Guide explaining how to deploy the site to IC mainnet and verify static gallery assets.",
  "frontend/index.css": "Tailwind base styles with OKLCH color variables and light/dark theme definitions.",
  "frontend/index.html": "Main HTML entry with metadata, GA4 tracking, favicon, and font loading for Arapey and Jost.",
  "frontend/README-GALLERY-ASSETS.md": "Instructions for replacing gallery images using a zip file and updating assets in the gallery directory.",
  "frontend/src/App.tsx": "Root app component assembling site sections with a feature flag controlling the Collections section.",
  "frontend/src/components/layout/SiteFooter.tsx": "Empty placeholder file for the site footer component.",
  "frontend/src/components/layout/SiteHeader.tsx": "Fixed header with logo, smooth-scrolling navigation, and responsive mobile menu.",
  "frontend/src/components/sections/AboutCapabilitiesSection.tsx": "Section listing four manufacturing capabilities using cards with icons and descriptions.",
  "frontend/src/components/sections/BenefitsSection.tsx": "Section showing four key designer benefits with icon cards and a centered heading.",
  "frontend/src/components/sections/CollectionsSection.tsx": "Renders a collections grid with thumbnails chosen via memoized random selection and displays titles, descriptions, and tags.",
  "frontend/src/components/sections/ContactCtaSection.tsx": "Displays contact cards for phone and location plus CTA buttons for WhatsApp messaging and Google Maps directions.",
  "frontend/src/components/sections/CustomCarpetsCtaSection.tsx": "Shows a custom carpets promo section with a hero image, capabilities list, and a WhatsApp CTA button.",
  "frontend/src/components/sections/GallerySection.tsx": "Implements an image gallery with lazy-loaded thumbnails, error handling, modal preview, and a link to view more.",
  "frontend/src/components/sections/HeroSection.tsx": "Provides the hero banner with a background image, intro text, and CTAs for viewing the gallery or starting a project.",
  "frontend/src/components/sections/UsefulLinksSection.tsx": "Renders a responsive grid of external links with icons, splitting primary and remaining links.",
  "frontend/src/config/contact.ts": "Defines contact details and exports a helper to build WhatsApp URLs with encoded messages.",
  "frontend/src/config/usefulLinks.ts": "Exports a list of external links such as Instagram, Google, and WhatsApp Channel.",
  "frontend/src/data/galleryImages.ts": "Defines image categories, metadata types, and the galleryImages array storing all gallery image entries.",
  "frontend/src/hooks/useActor.ts": "Provides a React hook that creates and manages a backend actor tied to the user’s Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, managing login, identity loading, and status tracking via AuthClient.",
  "frontend/src/index.css": "Sets Tailwind base styles, custom color variables, typography rules, and utility classes for the app.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/publicAssetUrl.ts": "Generates encoded public asset URLs by sanitizing paths and respecting the build’s base URL.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, color mappings, fonts, animations, and plugins.",
  "project_state.json": "Describes project state, features, and pending requests including image removal tasks."
}