{
  "backend/main.mo": "Minimal Motoko actor with no methods.",
  "feature_evidence.json": "Feature evidence report describing a header logo update and related files/components.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files for reference.",
  "frontend/DEPLOYMENT.md": "Guide outlining prerequisites and steps for deploying the site to IC mainnet, including required assets.",
  "frontend/index.css": "Tailwind base styles with extensive OKLCH CSS variables and dark mode definitions.",
  "frontend/index.html": "HTML entry with SEO metadata, favicon links, fonts, and script mount point.",
  "frontend/src/App.tsx": "Main React app assembling header and all page sections.",
  "frontend/src/components/layout/SiteFooter.tsx": "Empty file placeholder for a site footer component.",
  "frontend/src/components/layout/SiteHeader.tsx": "Fixed responsive header with logo, smooth-scroll navigation, and mobile menu.",
  "frontend/src/components/sections/AboutCapabilitiesSection.tsx": "Section presenting four manufacturing capabilities with icons and brief descriptions.",
  "frontend/src/components/sections/BenefitsSection.tsx": "Section highlighting four carpet benefits using icon cards in a responsive grid.",
  "frontend/src/components/sections/CollectionsSection.tsx": "Collections grid showing four carpet categories with randomized thumbnails and features.",
  "frontend/src/components/sections/ContactCtaSection.tsx": "Renders a contact section with cards for phone, email, and location plus buttons linking to sample requests and calls using CONTACT config.",
  "frontend/src/components/sections/GallerySection.tsx": "Displays a filterable image gallery with modal preview, error handling, and asset URL encoding via getPublicAssetUrl.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero banner with background image and buttons that smooth-scroll to gallery and contact sections.",
  "frontend/src/config/contact.ts": "Exports constant contact details including phone, email, and location with map URLs.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity with login, logout, identity loading, and status tracking.",
  "frontend/src/index.css": "Tailwind setup defining color variables, typography, and global styles for light and dark themes.",
  "frontend/src/main.tsx": "App entrypoint setting up React Query and InternetIdentityProvider before rendering App.",
  "frontend/src/utils/publicAssetUrl.ts": "Builds encoded URLs for static assets, respecting base paths and handling special characters.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, defining content paths, extending theme with custom colors, fonts, animations, and including typography, container queries, and animate plugins.",
  "project_state.json": "Project metadata storing current state, features, and a pending request related to resizing and centering a header logo image."
}