{
  "kind": "build_request",
  "title": "Adjust Gallery section header spacing and add end-of-section divider",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "In the selected Gallery section header (XPath: /html[1]/body[1]/div[1]/div[1]/main[1]/section[2]/div[1]), increase the vertical spacing between the heading and the subheading so it visually matches the spacing used between the heading and subheading in the last section’s header (Contact section).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "In section 1 - Increase the space between heading and subheading to match spacing in section 5 ( heading and subheading )"
        ]
      },
      "acceptanceCriteria": [
        "The Gallery section header’s <h2> and its descriptive <p> have noticeably more separation than before and visually matches the Contact section header spacing.",
        "The change is implemented only within the selected Gallery section container element (/main/section[2]/div[1]) and does not affect other sections."
      ]
    },
    {
      "id": "REQ-2",
      "text": "At the end of the selected Gallery section (XPath: /html[1]/body[1]/div[1]/div[1]/main[1]/section[2]), add a visual divider line that clearly separates it from the next section.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "At the end of section 2 add a visual divider"
        ]
      },
      "acceptanceCriteria": [
        "A horizontal divider (e.g., border-top/HR style) is visible at the bottom of the Gallery section content area.",
        "The divider is added within the selected Gallery section element (/main/section[2]) and does not introduce dividers in other sections."
      ]
    }
  ],
  "constraints": [
    "Apply changes ONLY to the elements identified by the provided XPaths: /html[1]/body[1]/div[1]/div[1]/main[1]/section[2]/div[1] and /html[1]/body[1]/div[1]/div[1]/main[1]/section[2].",
    "Do not modify any frontend immutable paths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Do not adjust spacing in any other section besides the selected Gallery section elements (even if the user referenced other sections).",
    "Do not change gallery grid layout, image assets, or modal behavior.",
    "No backend changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}