{
  "kind": "build_request",
  "title": "Match Benefits section mobile size and placement to provided screenshot",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the mobile layout of the Benefits section (frontend/src/components/sections/BenefitsSection.tsx) so its sizing and element placement match the provided reference screenshot (image-14.png). This includes mobile typography scale, spacing (section padding, header block spacing, inter-card spacing), and benefit-card layout (2-column grid on mobile with icon, title, and description aligned/positioned as shown).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "this is the size and placement i need for mobile view."
        ]
      },
      "acceptanceCriteria": [
        "On a small mobile viewport (e.g., 375px width), the Benefits section visually matches image-14.png for: (1) section heading and intro paragraph sizing and vertical spacing, (2) a 2x2 benefit grid with consistent gaps and centered alignment, (3) icon container size/shape and spacing above titles, (4) readable text sizes with no overflow or awkward wrapping.",
        "On md+ breakpoints, the existing responsive intent is preserved (2 columns at md, 4 columns at lg) without regressions.",
        "No changes are made to backend code."
      ]
    }
  ],
  "constraints": [
    "Edit only app-owned components; do not modify any files under frontend/src/components/ui or other immutable paths.",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "Adding new sections or changing the Benefits section marketing copy.",
    "Backend changes, data persistence, or authentication changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}