{
  "kind": "build_request",
  "title": "Make the Custom Carpets CTA image full-bleed with sharp edges",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update ONLY the selected image element (XPath: /html[1]/body[1]/div[1]/div[1]/main[1]/section[3]/div[1]/div[1]/div[1]/div[1]/div[1]/img[1]) in `frontend/src/components/sections/CustomCarpetsCtaSection.tsx` so it visually behaves like a cover image that stretches across the entire viewport width (no side margins) and has sharp (non-rounded) edges.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "can you get rid of the margins and stretch it across the entire screen width like cover image. Also sharp edges."
        ]
      },
      "acceptanceCriteria": [
        "On all breakpoints, the selected image renders edge-to-edge across the viewport width (no visible left/right margins around the image).",
        "The selected image uses a cover-style fit (no distortion; cropped as needed).",
        "The selected image has sharp corners (no rounding on the image itself).",
        "No other elements besides the selected image element are modified."
      ]
    }
  ],
  "constraints": [
    "Apply changes only to the selected element identified by the provided XPath; do not modify other DOM elements or components.",
    "Do not modify files in `frontend/src/components/ui` or other frontend immutable paths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Do not change the section layout, text content, or spacing of other elements in the Custom Carpets section.",
    "Do not add new images or modify existing image assets."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}