{
  "kind": "build_request",
  "title": "Update Benefits card label and justify benefit descriptions",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "In the Benefits section, change the benefit card title text from \"Responsible Materials\" to \"Sustainable\" (only within the selected element at /html/body/div/div/main/section[4]/div[1]).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "change responsible materials to Sustainable"
        ]
      },
      "acceptanceCriteria": [
        "The benefits card that previously displayed the title \"Responsible Materials\" now displays \"Sustainable\".",
        "No other section titles or copy elsewhere on the page are changed."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the Benefits card subtext (the benefit description paragraphs) to use justified alignment instead of center alignment (only within the selected element at /html/body/div/div/main/section[4]/div[1]).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Make the subtext alignment justified, right now it is center aligned."
        ]
      },
      "acceptanceCriteria": [
        "Benefit description text is rendered with CSS text alignment set to justify on mobile and desktop.",
        "Icons and titles remain visually centered as they are now; only the description/subtext alignment changes.",
        "No other paragraph text in other sections is affected."
      ]
    }
  ],
  "constraints": [
    "Apply changes only to the selected element (/html/body/div/div/main/section[4]/div[1]) in the Benefits section.",
    "Do not modify any files under frontend/src/components/ui or any frontend immutablePaths."
  ],
  "nonGoals": [
    "No changes to backend logic (Motoko actor remains unchanged).",
    "No layout/spacing redesign beyond the requested text changes and subtext alignment update."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}