{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Contact CTA tagline copy, centering, and add stable test hooks",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Update the Contact CTA heading and paragraph copy and ensure both lines remain center-aligned across breakpoints.",
      "acceptanceCriteria": [
        "In the Contact section, the heading text is exactly \"Designed by you,\" (including the comma).",
        "Directly beneath it, the paragraph text is exactly \"Executed by Us.\" (including the period and capitalization).",
        "Both lines are center-aligned on mobile and desktop (no breakpoint causes left alignment).",
        "The change affects only the selected <h2> and <p> elements; no other text in the Contact section is modified."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/ContactCtaSection.tsx",
          "operation": "modify",
          "description": "Modify ONLY the Contact CTA tagline <h2> and <p> (the two lines inside the first text-center wrapper) so the rendered text is exactly \"Designed by you,\" and \"Executed by Us.\"; add/ensure per-element centering (e.g., explicit text-center classes on these elements only) so alignment remains centered at all breakpoints without changing any other Contact section text or elements."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add stable, unique test hooks to the Contact CTA tagline heading and paragraph only.",
      "acceptanceCriteria": [
        "The selected <h2> has a unique data-testid attribute.",
        "The selected <p> has a unique data-testid attribute.",
        "No other elements in ContactCtaSection receive new attributes/classes as part of this request."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/ContactCtaSection.tsx",
          "operation": "modify",
          "description": "Add data-testid attributes to ONLY the selected Contact CTA <h2> and <p> elements (e.g., data-testid=\"contact-cta-heading\" and data-testid=\"contact-cta-tagline\"); do not add attributes/classes to any other elements in ContactCtaSection."
        }
      ]
    }
  ]
}