{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Benefits section copy update + justified benefit descriptions",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Rename the specified Benefits card title from \"Responsible Materials\" to \"Sustainable\" without changing any other page copy.",
      "acceptanceCriteria": [
        "The benefits card that previously displayed the title \"Responsible Materials\" now displays \"Sustainable\".",
        "No other section titles or copy elsewhere on the page are changed."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/BenefitsSection.tsx",
          "operation": "modify",
          "description": "Update the Benefits data so the card title text changes from \"Responsible Materials\" to \"Sustainable\" (scoped only to the Benefits section rendering under the container element referenced by /html/body/div/div/main/section[4]/div[1])."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Render only the Benefits card description/subtext paragraphs with justified text alignment while keeping icons and titles centered.",
      "acceptanceCriteria": [
        "Benefit description text is rendered with CSS text alignment set to justify on mobile and desktop.",
        "Icons and titles remain visually centered as they are now; only the description/subtext alignment changes.",
        "No other paragraph text in other sections is affected."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/BenefitsSection.tsx",
          "operation": "modify",
          "description": "Adjust the Benefits card markup/classes so the card container continues centering the icon and title, but the description <p> uses justified text alignment (e.g., apply a justify utility only to the description element and/or move the centering utility off the wrapper). Ensure the change is limited to the Benefits section subtree under /html/body/div/div/main/section[4]/div[1] and does not affect other sections' paragraphs."
        }
      ]
    }
  ]
}